/*
;*****************************************************************************************************
;*    							Copyright (c) 2006 by JiaoJinXing. 
;*									   All rights reserved.
;*
;*---- 文件信息 --------------------------------------------------------------------------------------
;* 文   件   名 : RS232.c
;* 创   建   人 : 风城少主
;* 描        述 : 串口输入输出相关文件。
;*
;*---- 历史版本信息 ----------------------------------------------------------------------------------
;* 日　		期  : 2008年 7 月 8 日
;* 创	建	人  : 风城少主
;* 描　		述  : 建立版本 V1.0.0
;*
;* 日　		期  : 2009年 1 月 30 日
;* 创	建	人  : 风城少主
;* 描　		述  : 维护程序
;*
;*---- 共同进步建立在友好的交流之上，欢迎用下面的联系方式与我交流！-----------------------------------
;* 
;* Email 	    : wyoujtg@163.com
;* Web 		    :
;*		    
;*****************************************************************************************************
;*/

	#include "Config.h"

	#include <stdarg.h>

/*
;*****************************************************************************************************
;* 函数名称 : RS232_Init
;* 描    述 : 初始化RS232串口
;* 输　	 入 : baudrate: 波特率
;*        
;* 输　	 出 : TRUE 或 FALSE
;*****************************************************************************************************
;*/
uint8 RS232_Init(uint32 baudrate)
{  
	// 晶振频率 : 16.0MHz
	// 通信参数: 8 Data, 1 Stop, No Parity 
	// 波特率:   19200
	 UCSRB = 0x00; //disable while setting baud rate
	 UCSRA = 0x00;
	 UCSRC = 0x06;
	 UBRRL = 0x33; //set baud rate lo
	 UBRRH = 0x00; //set baud rate hi
	 UCSRB = 0x18;

    return TRUE;
}

/*
;*****************************************************************************************************
;* 函数名称 : RS232_SendByte
;* 描    述 : 串口发送一字节数据，并等待发送完成
;* 输　	 入 : data: 要发送的数据
;*        
;* 输　	 出 : 无
;*****************************************************************************************************
;*/
void RS232_SendByte(uint8 data)
{  
   	if (data == '\n')
   	{
		data = '\r';				
	}	
	else
	if (data == '\t')
	{		
		data = ' ';
	
		// 检测是否可以发送, UDRE = 1 寄存器为空
		while ( !( UCSRA & (1 << UDRE)) )
			   ;
		UDR = data;
	
		// 检测是否可以发送, UDRE = 1 寄存器为空
		while ( !( UCSRA & (1 << UDRE)) )
			   ;
		UDR = data;
	
	}
	// 检测是否可以发送, UDRE = 1 寄存器为空
    while ( !( UCSRA & (1 << UDRE)) )
           ;
    UDR = data;
}

/*
;*****************************************************************************************************
;* 函数名称 : RS232_RecvByte
;* 描    述 : 从串口接收一字节数据
;* 输　	 入 : 无
;*        
;* 输　	 出 : 接收到的数据
;*****************************************************************************************************
;*/
uint8 RS232_RecvByte(void)
{  
	while (!(UCSRA & (1 << RXC)))
	{
		//OSTimeDly(1);
	}
	
    return UDR;
}

/*
;*****************************************************************************************************
;* 函数名称 : RS232_SendStr
;* 描    述 : 串口发送一字符串
;* 输　	 入 : str: 要发送的字符串
;*        
;* 输　	 出 : 无
;*****************************************************************************************************
;*/
void RS232_SendStr(char const *str)
{  
	char ch;

    if ((ch = *str++) != '\0')
    {
        do
        {
            RS232_SendByte(ch); 

        } while((ch = *str++) != '\0');

        RS232_SendByte('\n'); 
    }
}

/*
;*****************************************************************************************************
;* 函数名称 : RS232_RecvStr
;* 描    述 : 从串口接收一字符串
;* 输　	 入 : str: 字符串
;*   
;* 输　	 出 : 无 
;*****************************************************************************************************
;*/
void RS232_RecvStr(char *str)
{
    char ch;
    uint8 i = 0;

	
    if (str != 0)
    { 
        while (1)
        {
            ch = RS232_RecvByte();                           	//  接收1个字符
            
            if (ch == '\r')                         			//  如果接收回车符，则跳出
            {
                RS232_SendByte(ch);                           	//  回显该字符
                str[i] = '\0';                                  //  添加字符串结束标志                
                break;
            }
#define BACK_KEY 0x08
			if (ch == BACK_KEY)
#undef  BACK_KEY
			{					
				if (i)
				{
					RS232_SendByte(ch);
					RS232_SendByte(' ');
					RS232_SendByte(ch);	
				}
				i -= i ? 1 : 0;	
			}             
			else                                            	//  接收到的是可打印字符
			{
				str[i++] = ch;                                 	//  保存到缓冲区
				RS232_SendByte(ch);                           	//  回显该字符
			}
        }
    } 
}

/*
;*****************************************************************************************************
;* 函数名称 : RS232_Printf
;* 描    述 : 串口格式化输出数据
;* 输　	 入 : char *fmt, ...
;*        
;* 输　	 出 : 无
;*****************************************************************************************************
;*/
void RS232_Printf (char *fmt, ...)
{
	va_list ap; 						//参数变量定义
	char strval[6];     
	char *str;
	char *p; 
	int nval; 
    int8 i = 0;

	
	va_start(ap, fmt); 					//设置第一个参数为fmt
	
	for(p = fmt; *p; p++) 
	{ 
		if (*p != '%') 
		{
			RS232_SendByte(*p);
			continue; 
		} 
		
		p++; 
		
		switch (*p) 
		{ 
			case 'd': 
				nval = va_arg(ap, int); //按类型获取下一个参数
				i = 0;
				do
				{
					strval[i] = nval % 10;
					nval /= 10;
					i++;
				} while (nval > 0);
				i--;
				break; 
				
			case 'x': 
				nval = va_arg(ap, int); //按类型获取下一个参数
				i = 0;
				do
				{
					strval[i] = nval % 16;
					nval /= 16;
					i++;
				} while (nval > 0);
				i--;
				break; 
				
			case 'c': 
				 i = -1;
				 nval = va_arg(ap, int);							
				 RS232_SendByte(nval);			  
				 break;	
				 
		    case 's':
		    	i = -1;
				str = (char *)va_arg(ap, int);
				do
				{
					nval = *str++;
					if (nval != 0)
					{
						RS232_SendByte(nval);
					}
					else 
					{
						break;
					}
				} while (1);
				break;
				
			default: 
				break;	 
		} 
		
		for(; i >= 0; i--)
		{
			nval = strval[i] + '0';
			RS232_SendByte(nval);
		}
	}
	 
	va_end(ap); 						//结束参数变量的使用
}


/*
;*****************************************************************************************************
;*                            			End Of File
;*****************************************************************************************************
;*/
