#include "p24HJ64GP504.h"
#include "spi.h"

/***************************************************************************************************
                   spi1发送并读取一个字节函数
 原    型：unsigned char writeSPI1(unsigned char i)
 功    能：spi1发送并读取一个字节
 入口参数：unsigned char i 待写入字节
 出口参数：unsigned char读取的字节
***************************************************************************************************/    
extern unsigned char SPI1_ReadWrite(unsigned char i)   //写一个字节
{
    SPI1BUF = i;				
    while(!SPI1STATbits.SPIRBF);	       //接收完成也就是写完成   
    return SPI1BUF;    			           //返回接收的单字节  
}

/***************************************************************************************************
                   spi1中断配置函数
 原    型：void SPI1INTInit()
 功    能：spi1中断配置
 入口参数：无
 出口参数：无
***************************************************************************************************/    
extern void  SPI1_Init(void)
{
    IFS0bits.SPI1IF = 0;	              //清中断标志
    IEC0bits.SPI1IE = 0;	              //中断禁止
    SPI1CON1 = SPI_MASTER;                //8 位主控模式, CKE=1, CKP=0
    SPI1STAT = SPI_ENABLE;                //清除标志位，使能SPI
} 

/***************************************************************************************************
                   spi1中断处理函数
 原    型：void _SPI1Interrupt()
 功    能：spi1中断处理
 入口参数：无
 出口参数：无
***************************************************************************************************/    
extern void __attribute__((interrupt, no_auto_psv)) _SPI1Interrupt()
{
 IFS0bits.SPI1IF = 0; 	                  //清中断标志
}
